In [1]:
import pandas as pd
import numpy as np

## 分组

In [2]:
# 语法格式：df.groupby(分组的依据)[数据来源].使用操作

In [3]:
df = pd.read_csv('data/learn_pandas.csv')
df.head()

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,A,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,B,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,A,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,C,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,C,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22

In [ ]:
# 按照性别统计身高的中位数
# median():返回行或列的所有元素的中位数
df.groupby('Gender')['Height'].median() #对Height这一列根据Gender进行分组，然后使用median(方法)
#df,groupby('Gender')['Height'].median()

Gender
Female    159.6
Male      173.4
Name: Height, dtype: float64

In [5]:
# 分组的本质：只需要在groupby函数中传入相应的列名，或者是列名构成的列表即可。
# groupby的分组依据是从列中按名字进行获取即可
df.groupby(['School','Gender'])['Height'].mean()

School  Gender
A       Female    159.122500
        Male      176.760000
B       Female    158.666667
        Male      172.030000
C       Female    158.776923
        Male      174.212500
D       Female    159.753333
        Male      171.638889
Name: Height, dtype: float64

In [7]:
# eg:根据学生的体重是否超过总体的均值来分组
condition = df.Weight > df.Weight.mean()
condition

0      False
1       True
2       True
3      False
4       True
       ...
195    False
196    False
197    False
198     True
199    False
Name: Weight, Length: 200, dtype: bool

In [9]:
df.groupby(condition)['Height'].mean()

Weight
False    159.034646
True     172.705357
Name: Height, dtype: float64

In [28]:
# eg：使用随机传入字母序来验证以上结果
# choice():用于从给定的一维数组或列表中选择元素。
# 第一个参数可供选择的元素集合（列表）
# 第二个参数size表示要选择元素的个数
item = np.random.choice(list('abc'),df.shape[0])
# item
df.groupby(item)['Height'].mean()

a    162.707692
b    163.441667
c    163.558621
Name: Height, dtype: float64

In [18]:
# 将condition、item都传入groupby
df.groupby([condition,item])['Height'].mean()

Weight
False   a    158.767568
        b    158.975926
        c    159.397222
True    a    171.604545
        b    172.691667
        c    173.813636
Name: Height, dtype: float64

In [29]:
# drop_duplicates()
df[['School','Gender']].drop_duplicates()

   School  Gender
0       A  Female
1       B    Male
2       A    Male
3       C  Female
4       C    Male
5       D  Female
9       B  Female
16      D    Male

In [32]:
# df['School']   -----> df.School
df.groupby([df['School'],df['Gender']])['Height'].mean()

School  Gender
A       Female    159.122500
        Male      176.760000
B       Female    158.666667
        Male      172.030000
C       Female    158.776923
        Male      174.212500
D       Female    159.753333
        Male      171.638889
Name: Height, dtype: float64

### groupby对象

In [33]:
gb = df.groupby(['School','Grade'])
gb

In [35]:
# 常用属性
# groups：返回一个字典，该字典的键是分组的标签，值是每个组中元素的索引列表。
res = gb.groups
res.keys()

dict_keys([('A', 'Freshman'), ('A', 'Junior'), ('A', 'Senior'), ('A', 'Sophomore'), ('B', 'Freshman'), ('B', 'Junior'), ('B', 'Senior'), ('B', 'Sophomore'), ('C', 'Freshman'), ('C', 'Junior'), ('C', 'Senior'), ('C', 'Sophomore'), ('D', 'Freshman'), ('D', 'Junior'), ('D', 'Senior'), ('D', 'Sophomore')])

In [36]:
# ngroups:返回的分组的数量，也就是分组后不同的组的个数
gb.ngroups

16

In [37]:
# size()方法，返回每个组的大小，即每个组中元素的数量。它会返回一个series，索引是分组的标签，值是每个组的元素数量。
gb.size()

School  Grade
A       Freshman     13
        Junior       17
        Senior       22
        Sophomore     5
B       Freshman     13
        Junior        8
        Senior        8
        Sophomore     5
C       Freshman      9
        Junior       12
        Senior       11
        Sophomore     8
D       Freshman     17
        Junior       22
        Senior       14
        Sophomore    16
dtype: int64

In [41]:
# get_group():用户获取指定分组标签对应的组数据，返回的是DataFrame或者Series
gb.get_group(('A','Freshman')).iloc[:3,:3]

   School     Grade           Name
0       A  Freshman   Gaopeng Yang
6       A  Freshman      Qiang Chu
10      A  Freshman  Xiaopeng Zhou

In [42]:
# 分组的三大操作：
# 1、聚合*
# 2、变换*
# 3、过滤*

## 聚合

### 聚合的内置函数

In [44]:
# max/min/mean/median/count/all/any/idxmax/idxmin/mad/nunique/skew/quantile/sum/std/var/sem/size/prod
gb = df.groupby('Gender')['Height']
# gb.head()
gb

In [45]:
# max():计算每个组中的最大值
gb.max()

Gender
Female    170.2
Male      193.9
Name: Height, dtype: float64

In [46]:
# min():计算每个组中的最小值
gb.min()

Gender
Female    145.4
Male      155.7
Name: Height, dtype: float64

In [47]:
# mean():计算每个组中的平均值。
gb.mean()

Gender
Female    159.19697
Male      173.62549
Name: Height, dtype: float64

In [48]:
# median():计算每个组中的中位数
gb.median()

Gender
Female    159.6
Male      173.4
Name: Height, dtype: float64

In [52]:
# count():计算每个组中的非空值数量。
gb.count()
# all():检查每个组中是否所有值为True（对于布尔类型的数据）
gb.all()
# any():检查每个族中是否至少有一个值为True（对于布尔类型的数据）
# idxmax():返回每个组中最大值所在的索引。
# idxmin():返回每个组中最小值所在的索引。
# mad():计算每个组中的平均绝对偏差
# nunique():每个组中唯一值的数量
# skew():计算每个组中的偏度，衡量数据分布的不对称程度
# quantile():计算每个组中的指定分位数。
# sum():计算每组的总和
# std():计算每个组中的标准差，衡量数据的离散程度
# var():计算每个组中的方差，衡量数据的离散程度
# sem():计算每个组中的标准误差
# size():计算每个组的大小，即每个组中元素的数量。
# prod():计算每个组中所有值的乘积。
print(gb.any())
print(gb.idxmax())
print(gb.idxmin())
# print(gb.mad())    搜索
print(gb.nunique())
print(gb.skew())
print(gb.quantile(0.75))
print(gb.sum())
print(gb.std())
print(gb.var())
print(gb.sem())
print(gb.size())
print(gb.prod())

Gender
Female    True
Male      True
Name: Height, dtype: bool
Gender
Female     28
Male      193
Name: Height, dtype: int64
Gender
Female    143
Male      199
Name: Height, dtype: int64
Gender
Female    99
Male      47
Name: Height, dtype: int64
Gender
Female   -0.219253
Male      0.437535
Name: Height, dtype: float64
Gender
Female    162.825
Male      177.150
Name: Height, dtype: float64
Gender
Female    21014.0
Male       8854.9
Name: Height, dtype: float64
Gender
Female    5.053982
Male      7.048485
Name: Height, dtype: float64
Gender
Female    25.542739
Male      49.681137
Name: Height, dtype: float64
Gender
Female    0.439893
Male      0.986985
Name: Height, dtype: float64
Gender
Female    141
Male       59
Name: Height, dtype: int64
Gender
Female    4.232080e+290
Male      1.594210e+114
Name: Height, dtype: float64

In [53]:
# agg方法
# 它能对分组后的数据应用一个或多个聚合函数，实现多样化的统计分析。

In [54]:
df.head()

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,A,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,B,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,A,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,C,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,C,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22

In [56]:
gb = df.groupby('Gender')[['Height','Weight']]
# gb.head()
gb

In [57]:
# 基本用法
# 1、对单个列应用聚合函数
gb.agg({'Height':['mean'],'Weight':['mean']})

           Height     Weight
             mean       mean
Gender
Female  159.19697  47.918519
Male    173.62549  72.759259

In [58]:
# 2、对单个列应用多个聚合函数
gb.agg(['sum','idxmax','skew'])

         Height                   Weight
            sum idxmax      skew     sum idxmax      skew
Gender
Female  21014.0     28 -0.219253  6469.0     28 -0.268482
Male     8854.9    193  0.437535  3929.0      2 -0.332393

In [59]:
# 3、对多个列应用不同的聚合函数
gb.agg({'Height':['mean'],'Weight':['sum']})

           Height  Weight
             mean     sum
Gender
Female  159.19697  6469.0
Male    173.62549  3929.0

In [60]:
# 4、自定义聚合函数
gb.agg(lambda x:x.mean() - x.min())

          Height     Weight
Gender
Female  13.79697  13.918519
Male    17.92549  21.759259

In [65]:
# eg:定义一个函数，如果组的指标均值，超过该指标的总体均值，返回High，否则返回Low
def my_agg(s):
    res = 'High'
    if s.mean() <= df[s.name].mean():
        res = 'Low'
    return res
gb.agg(my_agg)

# df

       Height Weight
Gender
Female    Low    Low
Male     High   High

In [70]:
# 5、聚合结果重命名
# 如果想要对结果进行重命名，只需要将上述的位置改写成元组。
# 元组的第一个元素为新的名字，元组的第二个元素为原来的函数
# gb.agg('sum')
gb.agg([('range',lambda x:x.max() - x.min()),('my_sum','sum')])

       Height          Weight
        range   my_sum  range  my_sum
Gender
Female   24.8  21014.0   29.0  6469.0
Male     38.2   8854.9   38.0  3929.0

## 变换

### 变换函数与transform方法

In [71]:
# 常用的变换内置函数：
# cumcount/cumsum/cumprod/cummax/cummin
# cumcount() 对每个分组内的元素进行编号，从0开始
# cumsum() 对每个分组内的数据进行累积求和
# cumprod()  对每个分组内的数据进行累积求积
# cummax() 对每个分组内的数据进行累积求最大值
# cummin() 对每个分组内的数据进行累积求最小值

In [75]:
gb = df.groupby('Gender')[['Height','Weight']]
# gb.head()
gb

In [76]:
gb.cumcount().head()

0    0
1    0
2    1
3    1
4    2
dtype: int64

In [77]:
gb.cumsum().head()

   Height  Weight
0   158.9    46.0
1   166.5    70.0
2   355.4   159.0
3     NaN    87.0
4   529.4   233.0

In [78]:
gb.cumprod().head()

       Height    Weight
0      158.90      46.0
1      166.50      70.0
2    31451.85    6230.0
3         NaN    1886.0
4  5472621.90  461020.0

In [79]:
gb.cummax().head()

   Height  Weight
0   158.9    46.0
1   166.5    70.0
2   188.9    89.0
3     NaN    46.0
4   188.9    89.0

In [80]:
gb.cummin().head()

   Height  Weight
0   158.9    46.0
1   166.5    70.0
2   166.5    70.0
3     NaN    41.0
4   166.5    70.0

### transform方法

In [81]:
# 它可以对分组后的数据进行变换操作，与agg()方法不同，transform方法会返回一个与原数据具有相同索引的对象
#其主要作用是将聚合函数应用到每个分组，并将结果广播到每个分组内的所有元素上。

In [84]:
# 基本用户
# 1、对分组数据应用聚合函数
gb.mean()

           Height     Weight
Gender
Female  159.19697  47.918519
Male    173.62549  72.759259

In [85]:
gb.transform('mean').head()

      Height     Weight
0  159.19697  47.918519
1  173.62549  72.759259
2  173.62549  72.759259
3  159.19697  47.918519
4  173.62549  72.759259

In [86]:
# 2、自定义函数的应用
# lambda x: x.max() - x.min()
gb.transform(lambda x: x.max() - x.min()).head()

   Height  Weight
0    24.8    29.0
1    38.2    38.0
2    38.2    38.0
3    24.8    29.0
4    38.2    38.0

In [87]:
# 常见应用场景
# 1、数据标准化
gb.transform(lambda x:(x - x.mean()) / x.std()).head()

     Height    Weight
0 -0.058760 -0.354888
1 -1.010925 -0.355000
2  2.167063  2.089498
3       NaN -1.279789
4  0.053133  0.159631

In [89]:
# 缺失值填充
gb.transform(lambda x:x.fillna(x.mean())).count()

Height    200
Weight    200
dtype: int64

In [90]:
data = {
    'test1':['A','A','B','B'],
    'value':[10,np.nan,30,40]
}
df_demo = pd.DataFrame(data)
grouped = df_demo.groupby('test1')['value']
# 用每个分组的均值填充缺失数据
grouped.transform(lambda x:x.fillna(x.mean()))

0    10.0
1    10.0
2    30.0
3    40.0
Name: value, dtype: float64

## 过滤

### 组索引操作

In [91]:
# 1、获取分组索引
data = {
    'test1':['A','B','A','B'],
    'value':[10,20,15,25]
}
df_demo = pd.DataFrame(data)
df_demo

  test1  value
0     A     10
1     B     20
2     A     15
3     B     25

In [92]:
grouped = df_demo.groupby('test1')
# 查看组的索引信息
grouped.groups

{'A': [0, 2], 'B': [1, 3]}

In [93]:
# 2、遍历分组索引
# 使用for循环遍历分组后的结果，获取每个分组的标签和对应的DataFrame
for group_label,group_df in grouped:
    print(f"分组的标签：{group_label}")
    print(group_df)
    print()

分组的标签：A
  test1  value
0     A     10
2     A     15

分组的标签：B
  test1  value
1     B     20
3     B     25

### 组过滤操作

In [97]:
# 1、使用filter()方法
# filter()：方法用于根据自定义的条件过滤分组，返回一个满足条件的分组数据。filter()接收一个函数作为参数，该函数的输入是每个分组的DataFrame，返回值为布尔类型。


# 定义一个函数:实现过滤条件分组的平均值大于12
# grouped = df_demo.groupby('test1')
# grouped['value'].mean() > 12
def filter_con(group):
    return group['value'].mean() > 15

# 过滤分组
a_df = grouped.filter(filter_con)
print(a_df)

  test1  value
1     B     20
3     B     25

In [96]:
# 2、基于索引过滤分组
# 可以根据分组的标签选择特定分组
# eg：选择A分组
select_group = grouped.get_group('A')
print(select_group)

  test1  value
0     A     10
2     A     15